// Original by Markus Kuhn, adapted for HTML by Martin Dürst.
// UTF-8 encoded sample plain-text file
// ‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾‾
// Markus Kuhn [ˈmaʳkʊs kuːn] <mkuhn@acm.org> — 1999-08-20

// Mathematics and Sciences
string text1 = "∮ E⋅da = Q,  n → ∞, ∑ f(i) = ∏ g(i), ∀x∈ℝ: ⌈x⌉ = −⌊−x⌋, α ∧ ¬β = ¬(¬α ∨ β)";
string text2 = "ℕ ⊆ ℕ₀ ⊂ ℤ ⊂ ℚ ⊂ ℝ ⊂ ℂ, ⊥" + " < a ≠ b ≡ c ≤ d ≪ ⊤ ⇒ (A ⇔ B)" +
"2H₂ + O₂ ⇌ 2H₂O, R = 4.7 kΩ, ⌀ 200 mm";

// Linguistics and dictionaries:
string text3 = @UTF8
ði ıntəˈnæʃənəl fəˈnɛtık əsoʊsiˈeıʃn
Y [ˈʏpsilɔn], Yen [jɛn], Yoga [ˈjoːgɑ]
UTF8;

// APL:
string text4 = "(V⍳V)=⍳⍴V)/V←,V    ⌷←⍳→⍴∆∇⊃‾⍎⍕⌈";

// Nicer typography in plain text files:
string *text5 = @@UTF8
╔══════════════════════════════════════════╗
║                                          ║
║   • ‘single’ and “double” quotes         ║
║                                          ║
║   • Curly apostrophes: “We’ve been here” ║
║                                          ║
║   • Latin-1 apostrophe and accents: '´`  ║
║                                          ║
║   • ‚deutsche‘ „Anführungszeichen“       ║
║                                          ║
║   • †, ‡, ‰, •, 3–4, —, −5/+5, ™, …      ║
║                                          ║
║   • ASCII safety test: 1lI|, 0OD, 8B     ║
║                      ╭─────────╮         ║
║   • the euro symbol: │ 14.95 € │         ║
║                      ╰─────────╯         ║
╚══════════════════════════════════════════╝
UTF8;

// Greek (in Polytonic)
string text6 = @LONGUTF8
The Greek anthem:

  Σὲ γνωρίζω ἀπὸ τὴν κόψη
  τοῦ σπαθιοῦ τὴν τρομερή,
  σὲ γνωρίζω ἀπὸ τὴν ὄψη
  ποὺ μὲ βία μετράει τὴ γῆ.

  ᾿Απ᾿ τὰ κόκκαλα βγαλμένη
  τῶν ῾Ελλήνων τὰ ἱερά
  καὶ σὰν πρῶτα ἀνδρειωμένη
  χαῖρε, ὦ χαῖρε, ᾿Ελευθεριά!

  From a speech of Demosthenes in the 4th century BC:

  Οὐχὶ ταὐτὰ παρίσταταί μοι γιγνώσκειν, ὦ ἄνδρες ᾿Αθηναῖοι,
  ὅταν τ᾿ εἰς τὰ πράγματα ἀποβλέψω καὶ ὅταν πρὸς τοὺς
  λόγους οὓς ἀκούω· τοὺς μὲν γὰρ λόγους περὶ τοῦ
  τιμωρήσασθαι Φίλιππον ὁρῶ γιγνομένους, τὰ δὲ πράγματ᾿
  εἰς τοῦτο προήκοντα,  ὥσθ᾿ ὅπως μὴ πεισόμεθ᾿ αὐτοὶ
  πρότερον κακῶς σκέψασθαι δέον. οὐδέν οὖν ἄλλο μοι δοκοῦσιν
  οἱ τὰ τοιαῦτα λέγοντες ἢ τὴν ὑπόθεσιν, περὶ ἧς βουλεύεσθαι,
  οὐχὶ τὴν οὖσαν παριστάντες ὑμῖν ἁμαρτάνειν. ἐγὼ δέ, ὅτι μέν
  ποτ᾿ ἐξῆν τῇ πόλει καὶ τὰ αὑτῆς ἔχειν ἀσφαλῶς καὶ Φίλιππον
  τιμωρήσασθαι, καὶ μάλ᾿ ἀκριβῶς οἶδα· ἐπ᾿ ἐμοῦ γάρ, οὐ πάλαι
  γέγονεν ταῦτ᾿ ἀμφότερα· νῦν μέντοι πέπεισμαι τοῦθ᾿ ἱκανὸν
  προλαβεῖν ἡμῖν εἶναι τὴν πρώτην, ὅπως τοὺς συμμάχους
  σώσομεν. ἐὰν γὰρ τοῦτο βεβαίως ὑπάρξῃ, τότε καὶ περὶ τοῦ
  τίνα τιμωρήσεταί τις καὶ ὃν τρόπον ἐξέσται σκοπεῖν· πρὶν δὲ
  τὴν ἀρχὴν ὀρθῶς ὑποθέσθαι, μάταιον ἡγοῦμαι περὶ τῆς
  τελευτῆς ὁντινοῦν ποιεῖσθαι λόγον.

  Δημοσθένους, Γ´ ᾿Ολυνθιακὸς

Georgian:

  From a Unicode conference invitation:

  გთხოვთ ახლავე გაიაროთ რეგისტრაცია Unicode-ის მეათე საერთაშორისო
  კონფერენციაზე დასასწრებად, რომელიც გაიმართება 10-12 მარტს,
  ქ. მაინცში, გერმანიაში. კონფერენცია შეჰკრებს ერთად მსოფლიოს
  ექსპერტებს ისეთ დარგებში როგორიცაა ინტერნეტი და Unicode-ი,
  ინტერნაციონალიზაცია და ლოკალიზაცია, Unicode-ის გამოყენება
  ოპერაციულ სისტემებსა, და გამოყენებით პროგრამებში, შრიფტებში,
  ტექსტების დამუშავებასა და მრავალენოვან კომპიუტერულ სისტემებში.

Russian:

  From a Unicode conference invitation:

  Зарегистрируйтесь сейчас на Десятую Международную Конференцию по
  Unicode, которая состоится 10-12 марта 1997 года в Майнце в Германии.
  Конференция соберет широкий круг экспертов по  вопросам глобального
  Интернета и Unicode, локализации и интернационализации, воплощению и
  применению Unicode в различных операционных системах и программных
  приложениях, шрифтах, верстке и многоязычных компьютерных системах.

Thai (UCS Level 2):

  Excerpt from a poetry on The Romance of The Three Kingdoms (a Chinese
  classic 'San Gua'):

  [----------------------------|------------------------]
    ๏ แผ่นดินฮั่นเสื่อมโทรมแสนสังเวช  พระปกเกศกองบู๊กู้ขึ้นใหม่
  สิบสองกษัตริย์ก่อนหน้าแลถัดไป       สององค์ไซร้โง่เขลาเบาปัญญา
    ทรงนับถือขันทีเป็นที่พึ่ง           บ้านเมืองจึงวิปริตเป็นนักหนา
  โฮจิ๋นเรียกทัพทั่วหัวเมืองมา         หมายจะฆ่ามดชั่วตัวสำคัญ
    เหมือนขับไสไล่เสือจากเคหา      รับหมาป่าเข้ามาเลยอาสัญ
  ฝ่ายอ้องอุ้นยุแยกให้แตกกัน          ใช้สาวนั้นเป็นชนวนชื่นชวนใจ
    พลันลิฉุยกุยกีกลับก่อเหตุ          ช่างอาเพศจริงหนาฟ้าร้องไห้
  ต้องรบราฆ่าฟันจนบรรลัย           ฤๅหาใครค้ำชูกู้บรรลังก์ ฯ

  (The above is a two-column text. If combining characters are handled
  correctly, the lines of the second column should be aligned with the
  | character above.)

Ethiopian:

  Proverbs in the Amharic language:

  ሰማይ አይታረስ ንጉሥ አይከሰስ።
  ብላ ካለኝ እንደአባቴ በቆመጠኝ።
  ጌጥ ያለቤቱ ቁምጥና ነው።
  ደሀ በሕልሙ ቅቤ ባይጠጣ ንጣት በገደለው።
  የአፍ ወለምታ በቅቤ አይታሽም።
  አይጥ በበላ ዳዋ ተመታ።
  ሲተረጉሙ ይደረግሙ።
  ቀስ በቀስ፥ ዕንቁላል በእግሩ ይሄዳል።
  ድር ቢያብር አንበሳ ያስር።
  ሰው እንደቤቱ እንጅ እንደ ጉረቤቱ አይተዳደርም።
  እግዜር የከፈተውን ጉሮሮ ሳይዘጋው አይድርም።
  የጎረቤት ሌባ፥ ቢያዩት ይስቅ ባያዩት ያጠልቅ።
  ሥራ ከመፍታት ልጄን ላፋታት።
  ዓባይ ማደሪያ የለው፥ ግንድ ይዞ ይዞራል።
  የእስላም አገሩ መካ የአሞራ አገሩ ዋርካ።
  ተንጋሎ ቢተፉ ተመልሶ ባፉ።
  ወዳጅህ ማር ቢሆን ጨርስህ አትላሰው።
  እግርህን በፍራሽህ ልክ ዘርጋ።

Runes:

  ᚻᛖ ᚳᚹᚫᚦ ᚦᚫᛏ ᚻᛖ ᛒᚢᛞᛖ ᚩᚾ ᚦᚫᛗ ᛚᚪᚾᛞᛖ ᚾᚩᚱᚦᚹᛖᚪᚱᛞᚢᛗ ᚹᛁᚦ ᚦᚪ ᚹᛖᛥᚫ

  (Old English, which transcribed into Latin reads 'He cwaeth that he
  bude thaem lande northweardum with tha Westsae.' and means 'He said
  that he lived in the northern land near the Western Sea.')

Braille:

  ⡌⠁⠧⠑ ⠼⠁⠒  ⡍⠜⠇⠑⠹⠰⠎ ⡣⠕⠌

  ⡍⠜⠇⠑⠹ ⠺⠁⠎ ⠙⠑⠁⠙⠒ ⠞⠕ ⠃⠑⠛⠔ ⠺⠊⠹⠲ ⡹⠻⠑ ⠊⠎ ⠝⠕ ⠙⠳⠃⠞
  ⠱⠁⠞⠑⠧⠻ ⠁⠃⠳⠞ ⠹⠁⠞⠲ ⡹⠑ ⠗⠑⠛⠊⠌⠻ ⠕⠋ ⠙⠊⠎ ⠃⠥⠗⠊⠁⠇ ⠺⠁⠎
  ⠎⠊⠛⠝⠫ ⠃⠹ ⠹⠑ ⠊⠇⠻⠛⠹⠍⠁⠝⠂ ⠹⠑ ⠊⠇⠻⠅⠂ ⠹⠑ ⠥⠝⠙⠻⠞⠁⠅⠻⠂
  ⠁⠝⠙ ⠹⠑ ⠡⠊⠑⠋ ⠍⠳⠗⠝⠻⠲ ⡎⠊⠗⠕⠕⠛⠑ ⠎⠊⠛⠝⠫ ⠊⠞⠲ ⡁⠝⠙
  ⡎⠊⠗⠕⠕⠛⠑⠰⠎ ⠝⠁⠍⠑ ⠺⠁⠎ ⠛⠕⠕⠙ ⠥⠏⠕⠝ ⠰⡡⠁⠝⠛⠑⠂ ⠋⠕⠗ ⠁⠝⠹⠹⠔⠛ ⠙⠑
  ⠡⠕⠎⠑ ⠞⠕ ⠏⠥⠞ ⠙⠊⠎ ⠙⠁⠝⠙ ⠞⠕⠲

  ⡕⠇⠙ ⡍⠜⠇⠑⠹ ⠺⠁⠎ ⠁⠎ ⠙⠑⠁⠙ ⠁⠎ ⠁ ⠙⠕⠕⠗⠤⠝⠁⠊⠇⠲

  ⡍⠔⠙⠖ ⡊ ⠙⠕⠝⠰⠞ ⠍⠑⠁⠝ ⠞⠕ ⠎⠁⠹ ⠹⠁⠞ ⡊ ⠅⠝⠪⠂ ⠕⠋ ⠍⠹
  ⠪⠝ ⠅⠝⠪⠇⠫⠛⠑⠂ ⠱⠁⠞ ⠹⠻⠑ ⠊⠎ ⠏⠜⠞⠊⠊⠥⠇⠜⠇⠹ ⠙⠑⠁⠙ ⠁⠃⠳⠞
  ⠁ ⠙⠕⠕⠗⠤⠝⠁⠊⠇⠲ ⡊ ⠍⠊⠣⠞ ⠙⠁⠧⠑ ⠃⠑⠲ ⠔⠊⠇⠔⠫⠂ ⠍⠹⠎⠑⠇⠋⠂ ⠞⠕
  ⠗⠑⠛⠜⠙ ⠁ ⠊⠕⠋⠋⠔⠤⠝⠁⠊⠇ ⠁⠎ ⠹⠑ ⠙⠑⠁⠙⠑⠌ ⠏⠊⠑⠊⠑ ⠕⠋ ⠊⠗⠕⠝⠍⠕⠝⠛⠻⠹
  ⠔ ⠹⠑ ⠞⠗⠁⠙⠑⠲ ⡃⠥⠞ ⠹⠑ ⠺⠊⠎⠙⠕⠍ ⠕⠋ ⠳⠗ ⠁⠝⠊⠑⠌⠕⠗⠎
  ⠊⠎ ⠔ ⠹⠑ ⠎⠊⠍⠊⠇⠑⠆ ⠁⠝⠙ ⠍⠹ ⠥⠝⠙⠁⠇⠇⠪⠫ ⠙⠁⠝⠙⠎
  ⠩⠁⠇⠇ ⠝⠕⠞ ⠙⠊⠌⠥⠗⠃ ⠊⠞⠂ ⠕⠗ ⠹⠑ ⡊⠳⠝⠞⠗⠹⠰⠎ ⠙⠕⠝⠑ ⠋⠕⠗⠲ ⡹⠳
  ⠺⠊⠇⠇ ⠹⠻⠑⠋⠕⠗⠑ ⠏⠻⠍⠊⠞ ⠍⠑ ⠞⠕ ⠗⠑⠏⠑⠁⠞⠂ ⠑⠍⠏⠙⠁⠞⠊⠊⠁⠇⠇⠹⠂ ⠹⠁⠞
  ⡍⠜⠇⠑⠹ ⠺⠁⠎ ⠁⠎ ⠙⠑⠁⠙ ⠁⠎ ⠁ ⠙⠕⠕⠗⠤⠝⠁⠊⠇⠲

  (The first couple of paragraphs of "A Christmas Carol" by Dickens)

Compact font selection example text:

  ABCDEFGHIJKLMNOPQRSTUVWXYZ /0123456789
  abcdefghijklmnopqrstuvwxyz £©µÀÆÖÞßéöÿ
  –—‘“”„†•…‰™œŠŸž€ ΑΒΓΔΩαβγδω АБВГДабвгд
  ∀∂∈ℝ∧∪≡∞ ↑↗↨↻⇣ ┐┼╔╘░►☺♀ ﬁ�⑀₂ἠḂӥẄɐː⍎אԱა

Greetings in various languages:

  Hello world, Καλημέρα κόσμε, コンニチハ
LONGUTF8;

string text7 = @UTF8
Box drawing alignment tests:                                          █
                                                                      ▉
  ╔══╦══╗  ┌──┬──┐  ╭──┬──╮  ╭──┬──╮  ┏━━┳━━┓  ┎┒┏┑   ╷  ╻ ┏┯┓ ┌┰┐    ▊ ╱╲╱╲╳╳╳
  ║┌─╨─┐║  │╔═╧═╗│  │╒═╪═╕│  │╓─╁─╖│  ┃┌─╂─┐┃  ┗╃╄┙  ╶┼╴╺╋╸┠┼┨ ┝╋┥    ▋ ╲╱╲╱╳╳╳
  ║│╲ ╱│║  │║   ║│  ││ │ ││  │║ ┃ ║│  ┃│ ╿ │┃  ┍╅╆┓   ╵  ╹ ┗┷┛ └┸┘    ▌ ╱╲╱╲╳╳╳
  ╠╡ ╳ ╞╣  ├╢   ╟┤  ├┼─┼─┼┤  ├╫─╂─╫┤  ┣┿╾┼╼┿┫  ┕┛┖┚     ┌┄┄┐ ╎ ┏┅┅┓ ┋ ▍ ╲╱╲╱╳╳╳
  ║│╱ ╲│║  │║   ║│  ││ │ ││  │║ ┃ ║│  ┃│ ╽ │┃  ░░▒▒▓▓██ ┊  ┆ ╎ ╏  ┇ ┋ ▎
  ║└─╥─┘║  │╚═╤═╝│  │╘═╪═╛│  │╙─╀─╜│  ┃└─╂─┘┃  ░░▒▒▓▓██ ┊  ┆ ╎ ╏  ┇ ┋ ▏
  ╚══╩══╝  └──┴──┘  ╰──┴──╯  ╰──┴──╯  ┗━━┻━━┛           └╌╌┘ ╎ ┗╍╍┛ ┋  ▁▂▃▄▅▆▇█
UTF8;

string text8_cp1 = @UNICODE
\U0001f600
UNICODE;

string* text8_cp2 = @@UNICODE
\uD83D
UNICODE;

string text8_str = @UNICODE
😀​😁​😂​😃​😄​😅​😆​😇​😈​😉​😊​😋​😌​😍​😎​😏​😐​😑​😒​😓​😔​😕​😖​😗​😘​😙​😚​😛​😜​😝​😞​😟​😠​😡
​😢​😣​😤​😥​😦​😧​😨​😩​😪​😫​😬​😭​😮​😯​😰​😱​😲​😳​😴​😵​😶​😷​😸​😹​😺​😻​😼​😽​😾​😿​🙀​🙁​🙂​🙃
​🙄​🙅​🙆​🙇​🙈​🙉​🙊​🙋​🙌​🙍​🙎​🙏
UNICODE;

void do_tests() {
  string tmp;

  // string block don't process \U and \u
  ASSERT_EQ("\\U", text8_cp1[0..1]);
  // string block don't process \U and \u
  ASSERT_EQ("\\u", text8_cp2[0][0..1]);

  // strlen
  ASSERT_EQ(74, strlen(text1));
  ASSERT_EQ(92, strlen(text2));
  ASSERT_EQ(76, strlen(text3));
  ASSERT_EQ(31, strlen(text4));
  ASSERT_EQ(17, sizeof(text5));
  ASSERT_EQ(4801, sizeof(text6));
  ASSERT_EQ(strlen(text6), sizeof(text6));
  ASSERT_EQ(688, sizeof(text7));
  ASSERT_EQ(162, sizeof(text8_str));

  // Multi codepoint emoji
  tmp = "👩‍👩‍👧‍👧";
  ASSERT_EQ(1, strlen(tmp));

  // INDEX doesn't work with multi-codepoint character.
  ASSERT(catch(tmp[0] = 'a'));

  // INDEX
  ASSERT_EQ(22909, "好"[0]);
  ASSERT_EQ("⋅"[0], text1[3]);
  ASSERT_EQ("Q"[0], text1[9]);
  ASSERT_EQ("ð"[0], text3[0]);

  // RINDEX
  ASSERT_EQ("⍕"[0], text4[<2]);
  ASSERT_EQ("ɛ"[0], text3[<19]);

  // INDEX_LVALUE INC
  tmp = "白日依山尽";
  ASSERT_EQ(30333, tmp[0]);
  ASSERT_EQ(26085, tmp[1]);
  ASSERT_EQ(20381, tmp[2]);
  ASSERT_EQ(23665, tmp[3]);
  ASSERT_EQ(23613, tmp[4]);
  tmp[2]++;
  ++tmp[2];
  ASSERT_EQ(30333, tmp[0]);
  ASSERT_EQ(26085, tmp[1]);
  ASSERT_EQ(20383, tmp[2]);
  ASSERT_EQ(23665, tmp[3]);
  ASSERT_EQ(23613, tmp[4]);
  ASSERT_EQ("白日侟山尽", tmp);
  tmp[2]--;
  --tmp[2];
  ASSERT_EQ("白日依山尽", tmp);

  // INDEX_LVALUE ASSIGN
  tmp = text3;
  ASSERT_EQ(text3, tmp);
  ASSERT_EQ(230, tmp[9]);
  ASSERT_EQ(601, tmp[11]);
  tmp[10] = 30333;
  ASSERT_NE(text3, tmp);
  ASSERT_EQ(230, tmp[9]);
  ASSERT_EQ(30333, tmp[10]);
  ASSERT_EQ(601, tmp[11]);

  // FOREACH
  {
    int count = 0;

    tmp = "欲穷千里目🍆🍠🧮😊👌💩更上一层楼";
    foreach(int x in tmp) {
      count ++;
    }

    ASSERT_EQ(strlen(tmp), count);
  }

  // FOREACH REF
  {
    int count = 0;

    tmp = "欲穷千里目🍆🍠🧮😊👌💩更上一层楼";
    foreach(int ref x in tmp) {
      x++;
      count ++;
    }

    ASSERT_EQ(strlen(tmp), count);
  }

  // range operator, based on codepoint
  ASSERT_EQ("入", "黄河入海流"[2..2]);
  ASSERT_EQ("", "黄河入海流"[5..3]);
  ASSERT_EQ("黄河入海流", "黄河入海流"[0..4]);
  ASSERT_EQ("🧮😊", "🍆🍠🧮😊👌💩"[2..3]);
  ASSERT_EQ("👌💩", "🍆🍠🧮😊👌💩"[<2..<1]);

  // range operator for arrays
  ASSERT_EQ(text5[7..8], text5[<10..8]);

  // range operator for long texts
  ASSERT_EQ(strlen(text6) - 110 - 220 + 1, strlen(text6[110..<220]));

  // range lvalue
  tmp = "欲穷千里目，更上一层楼";
  tmp[5..5] = "💩";
  ASSERT_EQ("欲穷千里目💩更上一层楼", tmp);
  tmp[0..<1] = "🍆🍠🧮😊👌💩";
  ASSERT_EQ("🍆🍠🧮😊👌💩", tmp);
  tmp[<5..<2] = "欲穷千里目";
  ASSERT_EQ("🍆欲穷千里目💩", tmp);

  ASSERT_EQ("\uD83C\uDF46欲穷千里目\uD83D\uDCA9", tmp);

  ASSERT_EQ("👿", "\U0001F47F");

  // upper_case

  // lower_case

  // printf/sprintf
  tmp = "欲穷千里目🍆🍠🧮😊👌💩更上一层楼";
  ASSERT_EQ(tmp, sprintf("%s", tmp));
  ASSERT_EQ("\"" + tmp + "\"", sprintf("%O", tmp));

  // truncation
  ASSERT_EQ("欲穷千里目", sprintf("%.10s", tmp));
  ASSERT_EQ("欲穷千里目", sprintf("%.11s", tmp));
  ASSERT_EQ("欲穷千里", sprintf("%.9s", tmp));
  ASSERT_EQ("欲穷千里目🍆", sprintf("%.12s", tmp));
  ASSERT_EQ(tmp, sprintf("%.99s", tmp));

  ASSERT_EQ("欲穷千里目", sprintf("%1.10s", tmp));

  // https://github.com/fluffos/fluffos/issues/590
  ASSERT_EQ("测试ab", sprintf("%.6s","测试abcd 啊看 is abc sentence 好 不好\n"));

  // left, center, and right adjustment,
  // and count CJK chars and emojis as 2 width,  40 - 16 * 2 = 8
  ASSERT_EQ(repeat_string(" ", 4) + tmp + repeat_string(" ", 4), sprintf("%40|s", tmp));
  ASSERT_EQ(repeat_string(" ", 8) + tmp, sprintf("%40s", tmp));
  ASSERT_EQ(tmp + repeat_string(" ", 8), sprintf("%-40s", tmp));

  // adjustment works with grapheme cluster, not codepoints
  tmp = "欲穷a千里v目👩‍👩‍👧‍👧更上一层楼c";
  // correct with is 10 * 2 (cjk) + 2 (emoji) + 3 (ascii) = 25, field size = 40, 40 - 25 = 15
  ASSERT_EQ(repeat_string(" ", 8) + tmp + repeat_string(" ", 7), sprintf("%40|s", tmp));
  ASSERT_EQ(repeat_string(" ", 15) + tmp, sprintf("%40s", tmp));
  ASSERT_EQ(tmp + repeat_string(" ", 15), sprintf("%-40s", tmp));

  // column mode
  tmp = "欲穷千里目";
  ASSERT_EQ("欲\n穷\n千\n里\n目", sprintf("%-=1s", tmp));
  ASSERT_EQ("欲\n穷\n千\n里\n目", sprintf("%-=2s", tmp));
  ASSERT_EQ("欲\n穷\n千\n里\n目", sprintf("%-=3s", tmp));
  ASSERT_EQ("欲穷\n千里\n目", sprintf("%-=4s", tmp));

  tmp = "欲a穷aa千aaa里aaaa目";
  ASSERT_EQ("欲\na\n穷\naa\n千\naa\na\n里\naa\naa\n目", sprintf("%-=2s", tmp));
  ASSERT_EQ("欲a穷\naa千\naaa里\naaaa\n目", sprintf("%-=5s", tmp));

  // column mode with breakpoints
  tmp = "欲 穷 千 里 目";
  ASSERT_EQ("欲\n穷\n千\n里\n目", sprintf("%-=2s", tmp));

  tmp = "欲穷千里目 🍆🍠🧮\n😊👌💩\n更上一层楼欲穷千里目🍆🍠🧮😊👌💩更上一层楼";
  ASSERT_EQ("欲穷千里目\n🍆🍠🧮\n😊👌💩\n更上一层楼欲\n穷千里目🍆🍠\n🧮😊👌💩更上\n一层楼", sprintf("%-=12s", tmp));

  // column mode with truncation
  // https://github.com/fluffos/fluffos/issues/597
  tmp = "欲穷千里目";
  ASSERT_EQ("欲穷\n千里\n  目", sprintf("%1.4=s", tmp));

  // https://github.com/fluffos/fluffos/issues/590
  ASSERT_EQ("测试看\n啊看\nis abc\ns\nsenten\nce 好\n不好", sprintf("%=-6s", "测试看 啊看 is abc s sentence 好不好"));

  // table mode
  tmp = "一\n二\n三\n四\n五\n六\n七\n八\n九\n十\n甲\n乙\n丙\n丁\n戊";

  // perfect case
  ASSERT_EQ("一四七十丙\n"
            "二五八甲丁\n"
            "三六九乙戊",
            sprintf("%#10.5s", tmp));

  ASSERT_EQ("一六甲\n"
            "二七乙\n"
            "三八丙\n"
            "四九丁\n"
            "五十戊",
            sprintf("%#6.3s", tmp));

  // less perfect cases: not enough items
  ASSERT_EQ("一五九丙\n"
            "二六十丁\n"
            "三七甲戊\n"
            "四八乙",
            sprintf("%#8.4s", tmp));
  ASSERT_EQ(sprintf("%#8.4s", tmp), sprintf("%#10.4s", tmp));

  ASSERT_EQ("一四七十丙  \n"
            "二五八甲丁\n"
            "三六九乙戊",
            sprintf("%#12.6s", tmp));

  ASSERT_EQ("一四七十丙    \n"
            "二五八甲丁\n"
            "三六九乙戊",
            sprintf("%#14.7s", tmp));

  ASSERT_EQ("一三五七九甲丙戊\n"
            "二四六八十乙丁",
            sprintf("%#16.8s", tmp));

  ASSERT_EQ("一三五七九甲丙戊  \n"
            "二四六八十乙丁",
            sprintf("%#18.9s", tmp));

  ASSERT_EQ("一三五七九甲丙戊    \n"
            "二四六八十乙丁",
            sprintf("%#20.10s", tmp));

  ASSERT_EQ("一三五七九甲丙戊      \n"
            "二四六八十乙丁",
            sprintf("%#22.11s", tmp));

  ASSERT_EQ("一二三四五六七八九十甲乙丙丁戊",
            sprintf("%#30.15s", tmp));

  ASSERT_EQ("一二三四五六七八九十甲乙丙丁戊",
            sprintf("%#32.16s", tmp));

  ASSERT_EQ("一九\n"
            "二十\n"
            "三甲\n"
            "四乙\n"
            "五丙\n"
            "六丁\n"
            "七戊\n"
            "八",
            sprintf("%#4.2s", tmp));

  // adjustment
  ASSERT_EQ("  一  四  七  十  丙\n"
            "  二  五  八  甲  丁\n"
            "  三  六  九  乙  戊",
            sprintf("%#20.5s", tmp));

  ASSERT_EQ(" 一 四 七 十 丙\n"
            " 二 五 八 甲 丁\n"
            " 三 六 九 乙 戊",
            sprintf("%#19.5s", tmp));

  ASSERT_EQ("  一  四  七  十  丙\n"
            "  二  五  八  甲  丁\n"
            "  三  六  九  乙  戊",
            sprintf("%#21.5s", tmp));

  // truncation
  tmp = "一一\n二二\n三三\n四四\n五五\n六六\n七七\n八八\n九九\n十十\n甲甲\n乙乙\n丙丙\n丁丁\n戊戊";
  ASSERT_EQ("一一四四七七十十丙丙\n"
            "二二五五八八甲甲丁丁\n"
            "三三六六九九乙乙戊戊",
            sprintf("%#20.5s", tmp));

  ASSERT_EQ(" 一 四 七 十 丙\n"
            " 二 五 八 甲 丁\n"
            " 三 六 九 乙 戊",
            sprintf("%#19.5s", tmp));
  for(int i = 18; i > 14; i--) {
    ASSERT_EQ(sprintf("%#19.5s", tmp), sprintf("%#*.5s", i, tmp));
  }

  ASSERT_EQ("一四七十丙\n"
            "二五八甲丁\n"
            "三六九乙戊",
            sprintf("%#10.5s", tmp));
  for(int i = 14; i > 0; i--) {
    ASSERT_EQ(sprintf("%#10.5s", tmp), sprintf("%#*.5s", i, tmp));
  }

  ASSERT_EQ("我 看 \n"
            "测 效 ", sprintf("%#-10.3s","我说就是\n测试\n看看\n效果如何"));

  // auto columns
  // max_width = 8, fs= 8: col = 1
  ASSERT_EQ("我说就是\n"
            "    测试\n"
            "    看看\n"
            "效果如何", sprintf("%#8s","我说就是\n测试\n看看\n效果如何"));

  // col = 1
  ASSERT_EQ(" 我说就是\n"
            "     测试\n"
            "     看看\n"
            " 效果如何", sprintf("%#9s","我说就是\n测试\n看看\n效果如何"));

  // col = 1, with truncation
  ASSERT_EQ(" 我说就\n"
            "   测试\n"
            "   看看\n"
            " 效果如", sprintf("%#7s","我说就是\n测试\n看看\n效果如何"));

  // col = 2
  ASSERT_EQ("  我说就是      看看\n"
            "      测试  效果如何", sprintf("%#20s","我说就是\n测试\n看看\n效果如何"));

  // col = 3 will leave 1 item on next line, so back to col = 2
  ASSERT_EQ("       我说就是           看看\n"
            "           测试       效果如何", sprintf("%#30s","我说就是\n测试\n看看\n效果如何"));

  // col = 4
  ASSERT_EQ("  我说就是      测试      看看  效果如何", sprintf("%#40s","我说就是\n测试\n看看\n效果如何"));

  // padding with utf8 chars!
  tmp = "测试";
  ASSERT_EQ("田田田田测试田田田田", sprintf("%'田'|20s", tmp));
  ASSERT_EQ("测试田田田田田田田田", sprintf("%'田'-20s", tmp));
  ASSERT_EQ("田田田田田田田田测试", sprintf("%'田'20s", tmp));

  // less perfect cases
  ASSERT_EQ(" 田田田田测试田田田田", sprintf("%'田'|21s", tmp));
  ASSERT_EQ("测试田田田田田田田田 ", sprintf("%'田'-21s", tmp));
  ASSERT_EQ(" 田田田田田田田田测试", sprintf("%'田'21s", tmp));

  ASSERT_EQ("田田田田测试田田田 ", sprintf("%'田'|19s", tmp));
  ASSERT_EQ("测试田田田田田田田 ", sprintf("%'田'-19s", tmp));
  ASSERT_EQ(" 田田田田田田田测试", sprintf("%'田'19s", tmp));

  ASSERT_EQ(" 田田田田测试田田田田 ", sprintf("%'田'|22s", tmp));
  ASSERT_EQ("测试田田田田田田田田田", sprintf("%'田'-22s", tmp));
  ASSERT_EQ("田田田田田田田田田测试", sprintf("%'田'22s", tmp));

  // complex pad string with truncations
  ASSERT_EQ("aa田baa田测试aa田baa田", sprintf("%'aa田b'|22s", tmp));
  ASSERT_EQ("测试aa田baa田baa田baa ", sprintf("%'aa田b'-22s", tmp));
  ASSERT_EQ(" aa田baa田baa田baa测试", sprintf("%'aa田b'22s", tmp));

  // special char in pad string
  ASSERT_EQ("a\\b田c'a\\b测试a\\b田c'a\\b", sprintf("%'a\\\\b田c\\''|20s", tmp));
  ASSERT_EQ("测试a\\b田c'a\\b田c'a\\b田c'a", sprintf("%'a\\\\b田c\\''-20s", tmp));
  ASSERT_EQ("a\\b田c'a\\b田c'a\\b田c'a测试", sprintf("%'a\\\\b田c\\''20s", tmp));

  tmp = "一\n二\n三\n四\n五\n六\n七\n八\n九\n十\n甲\n乙\n丙\n丁\n戊";
  ASSERT_EQ("田一田四田七田十田丙\n"
            "田二田五田八田甲田丁\n"
            "田三田六田九田乙田戊",
            sprintf("%#'田'20.5s", tmp));
  ASSERT_EQ("田一田四田七田十田丙 \n"
            "田二田五田八田甲田丁 \n"
            "田三田六田九田乙田戊 ",
            sprintf("%#'田'21.5s", tmp));

  // char
  ASSERT_EQ(tmp[0..0], sprintf("%c", tmp[0]));

  // repeat_string
  ASSERT_EQ(text4 + repeat_string(text4, 2), repeat_string(text4, 3));

  // strsrch
  tmp = "一欲穷千里目🍆🍠🧮👩‍👩‍👧‍👧😊👌💩更上一层楼";
  // string searching
  ASSERT_EQ(0, strsrch(tmp, tmp[0..0]));
  ASSERT_EQ(15, strsrch(tmp, "一", 1));
  ASSERT_EQ(13, strsrch(tmp, "更"));
  ASSERT_EQ(13, strsrch(tmp, "更", 1));
  ASSERT_EQ(6, strsrch(tmp, "🍆🍠🧮"));
  ASSERT_EQ(6, strsrch(tmp, "🍆🍠🧮", 1));
  // EGC character based searching, not codepoint
  ASSERT_EQ(9, strsrch(tmp, "👩‍👩‍👧‍👧"));
  ASSERT_EQ(9, strsrch(tmp, "👩‍👩‍👧‍👧", 1));
  ASSERT_EQ(-1, strsrch(tmp, "👩‍👧"));
  ASSERT_EQ(-1, strsrch(tmp, "👩‍👧", 1));
  ASSERT_EQ(-1, strsrch(tmp, "🧮👩"));
  ASSERT_EQ(-1, strsrch(tmp, "🧮👩", 1));
  ASSERT_EQ(-1, strsrch(tmp, "‍👧😊‍"));
  ASSERT_EQ(-1, strsrch(tmp, "‍👧😊", 1));
  // codepoint based searching works for single codepoint characters
  ASSERT_EQ(0, strsrch(tmp, tmp[0]));
  ASSERT_EQ(15, strsrch(tmp, tmp[0], 1));
  ASSERT_EQ(-1, strsrch(tmp, 65533));
  ASSERT_EQ(-1, strsrch(tmp, 65533, 1));
  // but not for multi and invalid codepoints.
  ASSERT(catch(strsrch(tmp, 999999999999)));
  ASSERT(catch(strsrch(tmp, 999999999999, 1)));
}
